
/*Да се разработи програма тип „меню”  за поддържане на складово стопанство със следните изисквания:
1.	Наличностите в складовете се съхраняват в двоични файлове. За всяка стока в склада се пазят следните данни:
•	Номенклатурен номер  -  уникално 12 цифрено число;
•	Наименование на стоката  -  до 50 символен низ;
•	Единична цена  -  реално число;
•	Количество  -  цяло число;
•	Дата на производство на стоката  -  записана във формата ДД.ММ.ГГГГ.

2.	Да се извършват следните обработки:
а)  добавя нова стока в склада.
б)  променяне на наличностите от зададена стока ( добавяне или изваждане количества от склада ). При изваждане ако заявката е за повече съществуващото количество - да не се изпълнява. Ако наличностите станат равни на 0 стоката да се изключи от склада.
в)  извеждане информация за всички стоки от склада с изтекъл срок на годност (текущата дата се задава от потребителя).
г)  По зададен идентификационен номер да се разпечатва информацията за доставена стока.
3.	Данните да се поддържат в динамична структура - едносвързан списък в оперативната памет на ПК.*/


#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include"h10.h"




int main()
{
    wareHOUSE * head = NULL;

    readFile (&head);
    int key;


    do
    {
        key = menu();
        switch (key)
        {
        case 1:
        {
            ADDinLAST(&head);
            break;
        }
        case 2:
        {
            EDIT(&head);
            break;
        }
        case 3:
        {
            old(&head);
            break;
        }
        case 4:
        {
            printLIST(&head);
            break;
        }
        case 5:
        {
            writeSEARCH(&head);
            break;
        }
        case 6:
        {
            writeFILE(&head);
            MEMORYfree(&head);
            printf("\n\n           _-_-Goodbye!-_-_\n\n");
            break;
        }
        }
    }
    while (key != 7);
    return 0;
}
















